meeting/agenda/2024/04-09.org
:PROPERTIES:
:ID:       9B476AC6-9C16-451F-A3DF-26658D9192B5
:END:
#+title: QT4 CG Meeting 072 Agenda 2024-04-09
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT, 09:00PDT).

Note: The QT4CG meeting is scheduled on UK/European civil time. The UK and
Europe have now *also* switched to daylight saving time.
*The meeting will be in its “normal” slot again in the United States*, at least until the autumn.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/03-26.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 9 April. The following meeting is scheduled for
16 April.

Any regrets for 16 April 2024?

** Review of open action items [1/6]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record
+ [ ] QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.
+ [-] QT4CG-069-02: NW to coordinate with MK to use the introspection features on the test suite.
  + In progress…
+ [ ] QT4CG-070-01: NW to review how records are formatted.
+ [ ] QT4CG-071-01: MK to put namespace bindings for XQuery back on the issue list
+ [ ] QT4CG-071-02: MK to raise a PR that changes map construction examples as appropriate
+ [ ] QT4CG-071-03: MK to review the definition of map equality in ~fn:equal~
+ [ ] QT4CG-071-04: MK to update the prose to highlight differences between ~fn:equal~ and ~fn:deep-equal~
+ [ ] QT4CG-071-05: MK to consider the name of the function argument.
+ [ ] QT4CG-071-06: NW to clarify the cases that are distinguished by the leading empty string in path segments

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-956][#956]]: 850-partial Editorial improvements to parse-html()
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1134][#1134]]: 1133 Correct map:filter callback signature
+ PR [[https://qt4cg.org/dashboard/#pr-1128][#1128]]: 1020 Further notes on the consequences of function coercion
+ PR [[https://qt4cg.org/dashboard/#pr-1123][#1123]]: 1118 Drop the "map" keyword in adaptive serialization output
+ PR [[https://qt4cg.org/dashboard/#pr-1112][#1112]]: 1110-partial New error codes

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1105][#1105]]: Casting to numerical type from strings with underscores
+ Issue [[https://github.com/qt4cg/qtspecs/issues/983][#983]]: fn:reduce (or fn:fold without initial value)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/834][#834]]: Add creation function for `csv-row-record` type
+ Issue [[https://github.com/qt4cg/qtspecs/issues/713][#713]]: Annotations: Editorial notes
+ Issue [[https://github.com/qt4cg/qtspecs/issues/666][#666]]: Polyfill function implementations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/613][#613]]: Allow "union" as synonym for "|" everywhere
+ Issue [[https://github.com/qt4cg/qtspecs/issues/132][#132]]: Clarify if redirects should be followed
+ Issue [[https://github.com/qt4cg/qtspecs/issues/67][#67]]: Allow optional parameters and keyword arguments on map and sequence variadic functions.

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-1015][#1015]]: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes
+ PR [[https://qt4cg.org/dashboard/#pr-921][#921]]: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch
+ PR [[https://qt4cg.org/dashboard/#pr-871][#871]]: Action qt4 cg 027 01 next match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1137][#1137]]: 161 Variadic functions
+ PR [[https://qt4cg.org/dashboard/#pr-1132][#1132]]: 122 Choice item types (generalizing local union types)
+ PR [[https://qt4cg.org/dashboard/#pr-1131][#1131]]: 796,231 - Extend XPath for and let expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1125][#1125]]: 1094 Enhanced lookup expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1120][#1120]]: 99v2 deep equal with callback
+ PR [[https://qt4cg.org/dashboard/#pr-1117][#1117]]: 1116 Add options param to unparsed-text
+ PR [[https://qt4cg.org/dashboard/#pr-1108][#1108]]: 566-partial Describe a less aggressive %-encoding for fn:build-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1098][#1098]]: 566-partial Editorial improvements for parse-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1093][#1093]]: 1091 Add fn:collation function
+ PR [[https://qt4cg.org/dashboard/#pr-1087][#1087]]: 1086 Editorial changes to array:values
+ PR [[https://qt4cg.org/dashboard/#pr-1068][#1068]]: 73 fn:graphemes
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis - revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1027][#1027]]: 150 fn:ranks

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1069][#1069]]: fn:ucd
+ Issue [[https://github.com/qt4cg/qtspecs/issues/982][#982]]: Add position argument to scan-left and scan-right
+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/934][#934]]: String comparison in deep-equal
+ Issue [[https://github.com/qt4cg/qtspecs/issues/910][#910]]: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/908][#908]]: Function identity: documentation, nondeterminism
+ Issue [[https://github.com/qt4cg/qtspecs/issues/882][#882]]: fn:chain or fn:compose
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/657][#657]]: User-defined functions in main modules without `local` prefix
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/557][#557]]: fn:unparsed-binary: accessing and manipulating binary types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #1137: 161 Variadic functions
:PROPERTIES:
:CUSTOM_ID: pr-1137
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1137][#1137]]

** PR #1132: 122 Choice item types (generalizing local union types)
:PROPERTIES:
:CUSTOM_ID: pr-1132
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1132][#1132]]

** PR #1131: 796,231 - Extend XPath for and let expressions
:PROPERTIES:
:CUSTOM_ID: pr-1131
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1131][#1131]]

** PR #1125: 1094 Enhanced lookup expressions
:PROPERTIES:
:CUSTOM_ID: pr-1125
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1125][#1125]]

** PR #1120: 99v2 deep equal with callback
:PROPERTIES:
:CUSTOM_ID: pr-1120
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1120][#1120]]

** PR #1117: 1116 Add options param to unparsed-text
:PROPERTIES:
:CUSTOM_ID: pr-1117
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1117][#1117]]

** PR #1108: 566-partial Describe a less aggressive %-encoding for fn:build-uri
:PROPERTIES:
:CUSTOM_ID: pr-1108
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1108][#1108]]

** PR #1098: 566-partial Editorial improvements for parse-uri
:PROPERTIES:
:CUSTOM_ID: pr-1098
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1098][#1098]]

** PR #1093: 1091 Add fn:collation function
:PROPERTIES:
:CUSTOM_ID: pr-1093
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1093][#1093]]

** PR #1087: 1086 Editorial changes to array:values
:PROPERTIES:
:CUSTOM_ID: pr-1087
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1087][#1087]]

** PR #1068: 73 fn:graphemes
:PROPERTIES:
:CUSTOM_ID: pr-1068
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1068][#1068]]

** PR #1062/#1027: fn:ranks
:PROPERTIES:
:CUSTOM_ID: pr-1062
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]
See PR [[https://qt4cg.org/dashboard/#pr-1027][#1027]]


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
