meeting/agenda/2024/04-09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 072 Agenda 2024-04-09</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 072 Agenda 2024-04-09</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT, 09:00PDT).
</p>

<p>
Note: The QT4CG meeting is scheduled on UK/European civil time. The UK and
Europe have now <b>also</b> switched to daylight saving time.
<b>The meeting will be in its “normal” slot again in the United States</b>, at least until the autumn.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/03-26.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 9 April. The following meeting is scheduled for
16 April.
</p>

<p>
Any regrets for 16 April 2024?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/6]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.</li>
<li class="trans"><code>[-]</code> QT4CG-069-02: NW to coordinate with MK to use the introspection features on the test suite.
<ul class="org-ul">
<li>In progress…</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-070-01: NW to review how records are formatted.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-01: MK to put namespace bindings for XQuery back on the issue list</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-02: MK to raise a PR that changes map construction examples as appropriate</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-03: MK to review the definition of map equality in <code>fn:equal</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-04: MK to update the prose to highlight differences between <code>fn:equal</code> and <code>fn:deep-equal</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-05: MK to consider the name of the function argument.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-06: NW to clarify the cases that are distinguished by the leading empty string in path segments</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-956">#956</a>: 850-partial Editorial improvements to parse-html()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1134">#1134</a>: 1133 Correct map:filter callback signature</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1128">#1128</a>: 1020 Further notes on the consequences of function coercion</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1123">#1123</a>: 1118 Drop the "map" keyword in adaptive serialization output</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1112">#1112</a>: 1110-partial New error codes</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1105">#1105</a>: Casting to numerical type from strings with underscores</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/983">#983</a>: fn:reduce (or fn:fold without initial value)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/834">#834</a>: Add creation function for `csv-row-record` type</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/713">#713</a>: Annotations: Editorial notes</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/666">#666</a>: Polyfill function implementations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/613">#613</a>: Allow "union" as synonym for "|" everywhere</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/132">#132</a>: Clarify if redirects should be followed</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/67">#67</a>: Allow optional parameters and keyword arguments on map and sequence variadic functions.</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1137">#1137</a>: 161 Variadic functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1132">#1132</a>: 122 Choice item types (generalizing local union types)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1131">#1131</a>: 796,231 - Extend XPath for and let expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1125">#1125</a>: 1094 Enhanced lookup expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1120">#1120</a>: 99v2 deep equal with callback</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>: 1116 Add options param to unparsed-text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1108">#1108</a>: 566-partial Describe a less aggressive %-encoding for fn:build-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1098">#1098</a>: 566-partial Editorial improvements for parse-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1093">#1093</a>: 1091 Add fn:collation function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1087">#1087</a>: 1086 Editorial changes to array:values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>: 73 fn:graphemes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>: 150 fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.6.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1069">#1069</a>: fn:ucd</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/982">#982</a>: Add position argument to scan-left and scan-right</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/934">#934</a>: String comparison in deep-equal</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation, nondeterminism</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/882">#882</a>: fn:chain or fn:compose</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/657">#657</a>: User-defined functions in main modules without `local` prefix</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/583">#583</a>: array:replace(), etc</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-1137" class="outline-3">
<h3 id="pr-1137"><span class="section-number-3">2.1.</span> PR #1137: 161 Variadic functions</h3>
<div class="outline-text-3" id="text-pr-1137">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1137">#1137</a>
</p>
</div>
</div>

<div id="outline-container-pr-1132" class="outline-3">
<h3 id="pr-1132"><span class="section-number-3">2.2.</span> PR #1132: 122 Choice item types (generalizing local union types)</h3>
<div class="outline-text-3" id="text-pr-1132">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1132">#1132</a>
</p>
</div>
</div>

<div id="outline-container-pr-1131" class="outline-3">
<h3 id="pr-1131"><span class="section-number-3">2.3.</span> PR #1131: 796,231 - Extend XPath for and let expressions</h3>
<div class="outline-text-3" id="text-pr-1131">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1131">#1131</a>
</p>
</div>
</div>

<div id="outline-container-pr-1125" class="outline-3">
<h3 id="pr-1125"><span class="section-number-3">2.4.</span> PR #1125: 1094 Enhanced lookup expressions</h3>
<div class="outline-text-3" id="text-pr-1125">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1125">#1125</a>
</p>
</div>
</div>

<div id="outline-container-pr-1120" class="outline-3">
<h3 id="pr-1120"><span class="section-number-3">2.5.</span> PR #1120: 99v2 deep equal with callback</h3>
<div class="outline-text-3" id="text-pr-1120">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1120">#1120</a>
</p>
</div>
</div>

<div id="outline-container-pr-1117" class="outline-3">
<h3 id="pr-1117"><span class="section-number-3">2.6.</span> PR #1117: 1116 Add options param to unparsed-text</h3>
<div class="outline-text-3" id="text-pr-1117">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>
</p>
</div>
</div>

<div id="outline-container-pr-1108" class="outline-3">
<h3 id="pr-1108"><span class="section-number-3">2.7.</span> PR #1108: 566-partial Describe a less aggressive %-encoding for fn:build-uri</h3>
<div class="outline-text-3" id="text-pr-1108">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1108">#1108</a>
</p>
</div>
</div>

<div id="outline-container-pr-1098" class="outline-3">
<h3 id="pr-1098"><span class="section-number-3">2.8.</span> PR #1098: 566-partial Editorial improvements for parse-uri</h3>
<div class="outline-text-3" id="text-pr-1098">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1098">#1098</a>
</p>
</div>
</div>

<div id="outline-container-pr-1093" class="outline-3">
<h3 id="pr-1093"><span class="section-number-3">2.9.</span> PR #1093: 1091 Add fn:collation function</h3>
<div class="outline-text-3" id="text-pr-1093">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1093">#1093</a>
</p>
</div>
</div>

<div id="outline-container-pr-1087" class="outline-3">
<h3 id="pr-1087"><span class="section-number-3">2.10.</span> PR #1087: 1086 Editorial changes to array:values</h3>
<div class="outline-text-3" id="text-pr-1087">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1087">#1087</a>
</p>
</div>
</div>

<div id="outline-container-pr-1068" class="outline-3">
<h3 id="pr-1068"><span class="section-number-3">2.11.</span> PR #1068: 73 fn:graphemes</h3>
<div class="outline-text-3" id="text-pr-1068">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>
</p>
</div>
</div>

<div id="outline-container-pr-1062" class="outline-3">
<h3 id="pr-1062"><span class="section-number-3">2.12.</span> PR #1062/#1027: fn:ranks</h3>
<div class="outline-text-3" id="text-pr-1062">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>
See PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>
</p>
</div>
</div>
</div>


<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
